In [59]:
import pandas as pd
df1 = pd.read_csv('./data/lab.csv', encoding='cp932')
df1.head()

     number professor
0  A1578501    Trihan
1  A1578834    Trihan
2  A1678169        高橋
3  A1678554         炭
4  A1678625         辻

In [60]:
df2 = pd.read_csv('./data/students.csv', encoding='utf-8')
# df2.drop(["Unnamed: 0","Unnamed: 0.1"], axis=1)
df2.head()

     number student_name
0  A1578501          NaN
1  A1578834          NaN
2  A1678169          NaN
3  A1678554          NaN
4  A1678625          JIN

In [61]:
all_data = pd.merge(df2, df1, on='number')
all_data.index = all_data.index + 1
all_data.head()

     number student_name professor
1  A1578501          NaN    Trihan
2  A1578834          NaN    Trihan
3  A1678169          NaN        高橋
4  A1678554          NaN         炭
5  A1678625          JIN         辻

In [62]:
all_data.to_csv('./data/all_data.csv',encoding="SHIFT-JIS")